; ModuleID = 'libyaxoops.cap3mkxh-cgu.0'
source_filename = "libyaxoops.cap3mkxh-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"control_flow::Effect<u64>" = type { [0 x i64], { i64, i64 }, [0 x i8], i8, [7 x i8] }
%"semantic::test_isa::Instruction" = type { [0 x i64], i64, [0 x i8], i8, [0 x i8], [2 x i8], [0 x i8], i8, [4 x i8] }
%"unwind::libunwind::_Unwind_Exception" = type { [0 x i64], i64, [0 x i64], void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [0 x i64], [6 x i64], [0 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }
%"unix::linux_like::linux::pthread_mutex_t" = type { [0 x i8], [40 x i8], [0 x i8] }

@_ZN3std3sys4unix4args3imp15ARGV_INIT_ARRAY17h332d8fa11ca89018E = internal constant <{ i8*, [0 x i8] }> <{ i8* bitcast (void (i32, i8**, i8**)* @_ZN3std3sys4unix4args3imp15ARGV_INIT_ARRAY12init_wrapper17ha0784cf4b257b6e8E to i8*), [0 x i8] zeroinitializer }>, section ".init_array.00099", align 8, !dbg !0
@_ZN3std3sys4unix4args3imp4LOCK17h9fc7aead56154171E = internal global <{ [40 x i8] }> zeroinitializer, align 8, !dbg !15
@llvm.used = appending global [1 x i8*] [i8* bitcast (<{ i8*, [0 x i8] }>* @_ZN3std3sys4unix4args3imp15ARGV_INIT_ARRAY17h332d8fa11ca89018E to i8*)], section "llvm.metadata"

; Function Attrs: nounwind nonlazybind

!16 = distinct !DIGlobalVariable(name: "LOCK", linkageName: "_ZN3std3sys4unix4args3imp4LOCK17h9fc7aead56154171E", scope: !2, file: !7, line: 87, type: !17, isLocal: true, isDefinition: true, align: 8)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !19, file: !18, size: 320, align: 64, elements: !21, templateParams: !42, identifier: "50114f9336024478fe74e18d626ea689")
!18 = !DIFile(filename: "<unknown>", directory: "")
!19 = !DINamespace(name: "mutex", scope: !20)
!20 = !DINamespace(name: "sys_common", scope: !6)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !17, file: !18, baseType: !23, size: 320, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !24, file: !18, size: 320, align: 64, elements: !25, templateParams: !42, identifier: "c463fe8e322ccbdc4bfe2f0b8ae58cc8")
!24 = !DINamespace(name: "mutex", scope: !4)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !23, file: !18, baseType: !27, size: 320, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !28, file: !18, size: 320, align: 64, elements: !30, templateParams: !43, identifier: "f592d879ea4aadf6b052b6bbddc388df")
!28 = !DINamespace(name: "cell", scope: !29)
!29 = !DINamespace(name: "core", scope: null)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !27, file: !18, baseType: !32, size: 320, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !33, file: !18, size: 320, align: 64, elements: !37, templateParams: !42, identifier: "cf8cf8ee638cef50b983b9136ca695fe")
!33 = !DINamespace(name: "linux", scope: !34)
!34 = !DINamespace(name: "linux_like", scope: !35)
!35 = !DINamespace(name: "unix", scope: !36)
!36 = !DINamespace(name: "libc", scope: null)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !32, file: !18, baseType: !39, size: 320, align: 8)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 320, align: 8, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 40)
!42 = !{}
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !32)
!45 = !{i32 7, !"PIC Level", i32 2}
!46 = !{i32 2, !"RtLibUseGOT", i32 1}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !49, producer: "clang LLVM (rustc version 1.43.0-nightly (442ae7f04 2020-02-06))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !50, globals: !65)
!49 = !DIFile(filename: "src/liballoc/lib.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!50 = !{!51, !56}
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !52, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !53)
!52 = !DINamespace(name: "result", scope: !29)
!53 = !{!54, !55}
!54 = !DIEnumerator(name: "Ok", value: 0)
!55 = !DIEnumerator(name: "Err", value: 1)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !57, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !60)
!57 = !DINamespace(name: "v1", scope: !58)
!58 = !DINamespace(name: "rt", scope: !59)
!59 = !DINamespace(name: "fmt", scope: !29)
!60 = !{!61, !62, !63, !64}
!61 = !DIEnumerator(name: "Left", value: 0)
!62 = !DIEnumerator(name: "Right", value: 1)
!63 = !DIEnumerator(name: "Center", value: 2)
!64 = !DIEnumerator(name: "Unknown", value: 3)
!65 = !{!66, !101, !105, !109, !113, !121, !195, !207, !211, !215}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !69, identifier: "vtable")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !71, file: !18, size: 192, align: 64, elements: !73, templateParams: !42, identifier: "358633c3159928dfb467b7c91e1addd3")
!71 = !DINamespace(name: "string", scope: !72)
!72 = !DINamespace(name: "alloc", scope: null)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !70, file: !18, baseType: !75, size: 192, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8>", scope: !76, file: !18, size: 192, align: 64, elements: !77, templateParams: !91, identifier: "594e0f86a6b71766a6e9248ae5f8bca")
!76 = !DINamespace(name: "vec", scope: !72)
!77 = !{!78, !100}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !75, file: !18, baseType: !79, size: 128, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !80, file: !18, size: 128, align: 64, elements: !81, templateParams: !98, identifier: "23fb446d3fcf05bad099733b1c2a25b4")
!80 = !DINamespace(name: "raw_vec", scope: !72)
!81 = !{!82, !93, !95}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !79, file: !18, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !84, file: !18, size: 64, align: 64, elements: !86, templateParams: !91, identifier: "81a511faf43d8f24de30022e6291cdf8")
!84 = !DINamespace(name: "unique", scope: !85)
!85 = !DINamespace(name: "ptr", scope: !29)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !83, file: !18, baseType: !13, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !83, file: !18, baseType: !89, align: 8)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !90, file: !18, align: 8, elements: !42, templateParams: !91, identifier: "8779f8169efc99f318ddb73dd8816257")
!90 = !DINamespace(name: "marker", scope: !29)
!91 = !{!92}
!92 = !DITemplateTypeParameter(name: "T", type: !14)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !79, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !79, file: !18, baseType: !96, align: 8)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !97, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "6b65f6e47dde5f8b777c0f2cfa11aa7")
!97 = !DINamespace(name: "alloc", scope: !72)
!98 = !{!92, !99}
!99 = !DITemplateTypeParameter(name: "A", type: !96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !75, file: !18, baseType: !94, size: 64, align: 64, offset: 128)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !104, identifier: "vtable")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !14, size: 64, align: 64)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !108, identifier: "vtable")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !59, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "8a7678881eac89193b4aef93ca9aa597")
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !112, identifier: "vtable")
!112 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !116, identifier: "vtable")
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutErr", scope: !117, file: !18, align: 8, elements: !118, templateParams: !42, identifier: "4641a28491fed2de9d04a7d99af35ffc")
!117 = !DINamespace(name: "alloc", scope: !29)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !116, file: !18, baseType: !120, align: 8)
!120 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "EMPTY_ROOT_NODE", linkageName: "_ZN5alloc11collections5btree4node15EMPTY_ROOT_NODE17h433e7c030cfd1deaE", scope: !123, file: !126, line: 125, type: !127, isLocal: false, isDefinition: true, align: 8)
!123 = !DINamespace(name: "node", scope: !124)
!124 = !DINamespace(name: "btree", scope: !125)
!125 = !DINamespace(name: "collections", scope: !72)
!126 = !DIFile(filename: "src/liballoc/collections/btree/node.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeHeader<(), ()>", scope: !123, file: !18, size: 128, align: 64, elements: !128, templateParams: !166, identifier: "3751b83908737271d1cba82755a5017a")
!128 = !{!129, !193, !194}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !127, file: !18, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::InternalNode<(), ()>", baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalNode<(), ()>", scope: !123, file: !18, size: 896, align: 64, elements: !132, templateParams: !166, identifier: "87e38109e5613c4dff827294a6757d35")
!132 = !{!133, !169}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !18, baseType: !134, size: 128, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeafNode<(), ()>", scope: !123, file: !18, size: 128, align: 64, elements: !135, templateParams: !166, identifier: "89474da53b0a1edd96326b2eec4b835b")
!135 = !{!136, !137, !151, !152, !165}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !18, baseType: !130, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !134, file: !18, baseType: !138, size: 16, align: 16, offset: 64)
!138 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u16>", scope: !139, file: !18, size: 16, align: 16, elements: !141, templateParams: !149, identifier: "3049e9cab94c9fe6b015dd57086a5502")
!139 = !DINamespace(name: "maybe_uninit", scope: !140)
!140 = !DINamespace(name: "mem", scope: !29)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !138, file: !18, baseType: !120, align: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !138, file: !18, baseType: !144, size: 16, align: 16)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u16>", scope: !145, file: !18, size: 16, align: 16, elements: !146, templateParams: !149, identifier: "18733ad03566613bebae89c34df861b")
!145 = !DINamespace(name: "manually_drop", scope: !140)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !144, file: !18, baseType: !148, size: 16, align: 16)
!148 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !148)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !18, baseType: !148, size: 16, align: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !134, file: !18, baseType: !153, align: 8, offset: 96)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, align: 8, elements: !163)
!154 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<()>", scope: !139, file: !18, align: 8, elements: !155, templateParams: !161, identifier: "af1d363960d9a99748e5a5557744fe")
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !154, file: !18, baseType: !120, align: 8)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !154, file: !18, baseType: !158, align: 8)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<()>", scope: !145, file: !18, align: 8, elements: !159, templateParams: !161, identifier: "4611b20d7ec0d959e4fbf87d153ae6e3")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !158, file: !18, baseType: !120, align: 8)
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "T", type: !120)
!163 = !{!164}
!164 = !DISubrange(count: 11)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !134, file: !18, baseType: !153, align: 8, offset: 96)
!166 = !{!167, !168}
!167 = !DITemplateTypeParameter(name: "K", type: !120)
!168 = !DITemplateTypeParameter(name: "V", type: !120)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !131, file: !18, baseType: !170, size: 768, align: 64, offset: 128)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 768, align: 64, elements: !191)
!171 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<alloc::collections::btree::node::BoxedNode<(), ()>>", scope: !139, file: !18, size: 64, align: 64, elements: !172, templateParams: !189, identifier: "e6e53a56e8c4c3b1a4d815585402bd32")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !171, file: !18, baseType: !120, align: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !18, baseType: !175, size: 64, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::collections::btree::node::BoxedNode<(), ()>>", scope: !145, file: !18, size: 64, align: 64, elements: !176, templateParams: !189, identifier: "df075669f96e78e7ce38dc0164982466")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !175, file: !18, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "BoxedNode<(), ()>", scope: !123, file: !18, size: 64, align: 64, elements: !179, templateParams: !166, identifier: "322529af315e405a9d795b1126b26677")
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !178, file: !18, baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::collections::btree::node::LeafNode<(), ()>>", scope: !84, file: !18, size: 64, align: 64, elements: !182, templateParams: !187, identifier: "79e004608e15619d2375240ca8485953")
!182 = !{!183, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !181, file: !18, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::LeafNode<(), ()>", baseType: !134, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !181, file: !18, baseType: !186, align: 8)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::collections::btree::node::LeafNode<(), ()>>", scope: !90, file: !18, align: 8, elements: !42, templateParams: !187, identifier: "5bd5af870e7ede474544ed3a73475a54")
!187 = !{!188}
!188 = !DITemplateTypeParameter(name: "T", type: !134)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "T", type: !178)
!191 = !{!192}
!192 = !DISubrange(count: 12)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !127, file: !18, baseType: !138, size: 16, align: 16, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !127, file: !18, baseType: !148, size: 16, align: 16, offset: 80)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !198, identifier: "vtable")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::alloc::Layout", baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !117, file: !18, size: 128, align: 64, elements: !200, templateParams: !42, identifier: "7fa64db0a7ba18dd3bc2d6ad637eca96")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !199, file: !18, baseType: !94, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "align_", scope: !199, file: !18, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroUsize", scope: !204, file: !18, size: 64, align: 64, elements: !205, templateParams: !42, identifier: "ac92dff0066757086a339d3a66289f42")
!204 = !DINamespace(name: "num", scope: !29)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !203, file: !18, baseType: !94, size: 64, align: 64)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !210, identifier: "vtable")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !120, size: 64, align: 64)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !214, identifier: "vtable")
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8>", baseType: !75, size: 64, align: 64)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !218, identifier: "vtable")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::str::Utf8Error", baseType: !219, size: 64, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !220, file: !18, size: 128, align: 64, elements: !221, templateParams: !42, identifier: "bb45c60193e5579c2ee98e07e8d6a512")
!220 = !DINamespace(name: "str", scope: !29)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !219, file: !18, baseType: !94, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !219, file: !18, baseType: !224, size: 16, align: 8, offset: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !225, file: !18, size: 16, align: 8, elements: !226, identifier: "e481ab9ce3275476d376df169bf4feda")
!225 = !DINamespace(name: "option", scope: !29)
!226 = !{!227}
!227 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 16, align: 8, elements: !228, templateParams: !91, identifier: "e481ab9ce3275476d376df169bf4feda_variant_part", discriminator: !235)
!228 = !{!229, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !227, file: !18, baseType: !230, size: 16, align: 8, extraData: i64 0)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !224, file: !18, size: 16, align: 8, elements: !42, templateParams: !91, identifier: "e481ab9ce3275476d376df169bf4feda::None")
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !227, file: !18, baseType: !232, size: 16, align: 8, extraData: i64 1)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !224, file: !18, size: 16, align: 8, elements: !233, templateParams: !91, identifier: "e481ab9ce3275476d376df169bf4feda::Some")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !232, file: !18, baseType: !14, size: 8, align: 8, offset: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagArtificial)
!236 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !237, producer: "clang LLVM (rustc version 1.43.0-nightly (442ae7f04 2020-02-06))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !238, globals: !251)
!237 = !DIFile(filename: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-0.3.40/src/lib.rs", directory: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-0.3.40")
!238 = !{!51, !56, !239, !244}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !240, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !241)
!240 = !DINamespace(name: "ffi", scope: !29)
!241 = !{!242, !243}
!242 = !DIEnumerator(name: "__variant1", value: 0)
!243 = !DIEnumerator(name: "__variant2", value: 1)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrintFmt", scope: !245, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !247)
!245 = !DINamespace(name: "print", scope: !246)
!246 = !DINamespace(name: "backtrace", scope: null)
!247 = !{!248, !249, !250}
!248 = !DIEnumerator(name: "Short", value: 0)
!249 = !DIEnumerator(name: "Full", value: 1)
!250 = !DIEnumerator(name: "__Nonexhaustive", value: 2)
!251 = !{!252, !256, !258, !262, !339, !343, !354, !376, !383, !392}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !255, identifier: "vtable")
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !148, size: 64, align: 64)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !103, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !261, identifier: "vtable")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !239, size: 64, align: 64)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !265, identifier: "vtable")
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "SymbolName", scope: !266, file: !18, size: 640, align: 64, elements: !267, templateParams: !42, identifier: "8acae222ba3bcf7cf2eef0eff7430a33")
!266 = !DINamespace(name: "symbolize", scope: !246)
!267 = !{!268, !273, !332}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !265, file: !18, baseType: !269, size: 128, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !18, size: 128, align: 64, elements: !270, templateParams: !42, identifier: "77a791bc5b00f512104688e88bf00bee")
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !269, file: !18, baseType: !13, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !269, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "demangled", scope: !265, file: !18, baseType: !274, size: 512, align: 64, offset: 128)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<rustc_demangle::Demangle>", scope: !225, file: !18, size: 512, align: 64, elements: !275, identifier: "b0f933942a1b93288d2244e8de3c2867")
!275 = !{!276}
!276 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 512, align: 64, elements: !277, templateParams: !280, identifier: "b0f933942a1b93288d2244e8de3c2867_variant_part", discriminator: !325)
!277 = !{!278, !328}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !276, file: !18, baseType: !279, size: 512, align: 64, extraData: i64 3)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !274, file: !18, size: 512, align: 64, elements: !42, templateParams: !280, identifier: "b0f933942a1b93288d2244e8de3c2867::None")
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Demangle", scope: !283, file: !18, size: 512, align: 64, elements: !284, templateParams: !42, identifier: "9b6a476718fc1d6a8aba0cc653e080")
!283 = !DINamespace(name: "rustc_demangle", scope: null)
!284 = !{!285, !326, !327}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !282, file: !18, baseType: !286, size: 256, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<rustc_demangle::DemangleStyle>", scope: !225, file: !18, size: 256, align: 64, elements: !287, identifier: "396f266363aecb3f81e3a9ace97b2557")
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 256, align: 64, elements: !289, templateParams: !292, identifier: "396f266363aecb3f81e3a9ace97b2557_variant_part", discriminator: !325)
!289 = !{!290, !321}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !288, file: !18, baseType: !291, size: 256, align: 64, extraData: i64 2)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !286, file: !18, size: 256, align: 64, elements: !42, templateParams: !292, identifier: "396f266363aecb3f81e3a9ace97b2557::None")
!292 = !{!293}
!293 = !DITemplateTypeParameter(name: "T", type: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "DemangleStyle", scope: !283, file: !18, size: 256, align: 64, elements: !295, identifier: "1d8d33e5fd5ef6c7f5b567c5644e6066")
!295 = !{!296}
!296 = !DICompositeType(tag: DW_TAG_variant_part, scope: !283, file: !18, size: 256, align: 64, elements: !297, templateParams: !42, identifier: "1d8d33e5fd5ef6c7f5b567c5644e6066_variant_part", discriminator: !319)
!297 = !{!298, !311}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Legacy", scope: !296, file: !18, baseType: !299, size: 256, align: 64, extraData: i64 0)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Legacy", scope: !294, file: !18, size: 256, align: 64, elements: !300, templateParams: !42, identifier: "1d8d33e5fd5ef6c7f5b567c5644e6066::Legacy")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !299, file: !18, baseType: !302, size: 192, align: 64, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Demangle", scope: !303, file: !18, size: 192, align: 64, elements: !304, templateParams: !42, identifier: "269fb8f431358156da25c0b4623cde67")
!303 = !DINamespace(name: "legacy", scope: !283)
!304 = !{!305, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !302, file: !18, baseType: !306, size: 128, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !18, size: 128, align: 64, elements: !307, templateParams: !42, identifier: "111094d970b097647de579f9c509ef08")
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !306, file: !18, baseType: !13, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !306, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !302, file: !18, baseType: !94, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "V0", scope: !296, file: !18, baseType: !312, size: 256, align: 64, extraData: i64 1)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "V0", scope: !294, file: !18, size: 256, align: 64, elements: !313, templateParams: !42, identifier: "1d8d33e5fd5ef6c7f5b567c5644e6066::V0")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !312, file: !18, baseType: !315, size: 128, align: 64, offset: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Demangle", scope: !316, file: !18, size: 128, align: 64, elements: !317, templateParams: !42, identifier: "785562f3286b064b644089f5d631b033")
!316 = !DINamespace(name: "v0", scope: !283)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !315, file: !18, baseType: !306, size: 128, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !18, baseType: !320, size: 64, align: 64, flags: DIFlagArtificial)
!320 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !288, file: !18, baseType: !322, size: 256, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !286, file: !18, size: 256, align: 64, elements: !323, templateParams: !292, identifier: "396f266363aecb3f81e3a9ace97b2557::Some")
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !322, file: !18, baseType: !294, size: 256, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !18, baseType: !320, size: 64, align: 64, flags: DIFlagArtificial)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !282, file: !18, baseType: !306, size: 128, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !282, file: !18, baseType: !306, size: 128, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !276, file: !18, baseType: !329, size: 512, align: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !274, file: !18, size: 512, align: 64, elements: !330, templateParams: !280, identifier: "b0f933942a1b93288d2244e8de3c2867::Some")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !329, file: !18, baseType: !282, size: 512, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_demangled", scope: !265, file: !18, baseType: !333, align: 8)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "OptionCppSymbol", scope: !266, file: !18, align: 8, elements: !334, templateParams: !42, identifier: "6ae4c837cd0ba5291f0d7d369be04f44")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !18, baseType: !336, align: 8)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !90, file: !18, align: 8, elements: !42, templateParams: !337, identifier: "f5ee78cbb769ec37eac23a9e74276ec4")
!337 = !{!338}
!338 = !DITemplateTypeParameter(name: "T", type: !210)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !342, identifier: "vtable")
!342 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "STATE", linkageName: "_ZN9backtrace9symbolize12libbacktrace10init_state5STATE17h6c598a46674159c6E", scope: !345, file: !347, line: 260, type: !348, isLocal: true, isDefinition: true, align: 8)
!345 = !DINamespace(name: "init_state", scope: !346)
!346 = !DINamespace(name: "libbacktrace", scope: !266)
!347 = !DIFile(filename: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-0.3.40/src/symbolize/libbacktrace.rs", directory: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-0.3.40")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut backtrace_sys::bindings::backtrace_state", baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "backtrace_state", scope: !350, file: !18, align: 8, elements: !352, identifier: "7acb123489a7b96e5e7dd979dd9505a1")
!350 = !DINamespace(name: "bindings", scope: !351)
!351 = !DINamespace(name: "backtrace_sys", scope: null)
!352 = !{!353}
!353 = !DICompositeType(tag: DW_TAG_variant_part, scope: !350, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "7acb123489a7b96e5e7dd979dd9505a1_variant_part")
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !357, identifier: "vtable")
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !358, file: !18, size: 128, align: 64, elements: !359, templateParams: !42, identifier: "996d971c794847a14cf77e2e98082d4b")
!358 = !DINamespace(name: "resolve", scope: !346)
!359 = !{!360, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !357, file: !18, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bool", baseType: !362, size: 64, align: 64)
!362 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !357, file: !18, baseType: !364, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &mut FnMut<(&backtrace::symbolize::Symbol)>", baseType: !365, size: 64, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut FnMut<(&backtrace::symbolize::Symbol)>", scope: !366, file: !18, size: 128, align: 64, elements: !368, templateParams: !42, identifier: "94a637a1e00ff1981b76f896cb55c54")
!366 = !DINamespace(name: "function", scope: !367)
!367 = !DINamespace(name: "ops", scope: !29)
!368 = !{!369, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !365, file: !18, baseType: !370, size: 64, align: 64, flags: DIFlagArtificial)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !14, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !365, file: !18, baseType: !372, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, align: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 3)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !379, identifier: "vtable")
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure-0", scope: !380, file: !18, size: 64, align: 64, elements: !381, templateParams: !42, identifier: "7440b61171398a20d8ffe7a689c9538a")
!380 = !DINamespace(name: "dladdr_fallback", scope: !346)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !379, file: !18, baseType: !364, size: 64, align: 64)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !386, identifier: "vtable")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u16]", baseType: !387, size: 64, align: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u16]", file: !18, size: 128, align: 64, elements: !388, templateParams: !42, identifier: "e83c100704bc49755c9321b6b9a3c71")
!388 = !{!389, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !387, file: !18, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !148, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !387, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !395, identifier: "vtable")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u8]", baseType: !269, size: 64, align: 64)
!396 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !397, producer: "clang LLVM (rustc version 1.43.0-nightly (442ae7f04 2020-02-06))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !42)
!397 = !DIFile(filename: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-sys-0.1.32/src/lib.rs", directory: "/cargo/registry/src/github.com-1ecc6299db9ec823/backtrace-sys-0.1.32")
!398 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !399, producer: "clang LLVM (rustc version 1.43.0-nightly (442ae7f04 2020-02-06))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !42)
!399 = !DIFile(filename: "/cargo/registry/src/github.com-1ecc6299db9ec823/cfg-if-0.1.10/src/lib.rs", directory: "/cargo/registry/src/github.com-1ecc6299db9ec823/cfg-if-0.1.10")
!400 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !401, producer: "clang LLVM (rustc version 1.43.0-nightly (442ae7f04 2020-02-06))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !402, globals: !436)
!401 = !DIFile(filename: "src/libcore/lib.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!402 = !{!403, !408, !414, !56, !51, !423, !428, !239}
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FloatErrorKind", scope: !404, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !405)
!404 = !DINamespace(name: "dec2flt", scope: !204)
!405 = !{!406, !407}
!406 = !DIEnumerator(name: "Empty", value: 0)
!407 = !DIEnumerator(name: "Invalid", value: 1)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !204, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !409)
!409 = !{!406, !410, !411, !412, !413}
!410 = !DIEnumerator(name: "InvalidDigit", value: 1)
!411 = !DIEnumerator(name: "Overflow", value: 2)
!412 = !DIEnumerator(name: "Underflow", value: 3)
!413 = !DIEnumerator(name: "Zero", value: 4)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EscapeUnicodeState", scope: !415, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !416)
!415 = !DINamespace(name: "char", scope: !29)
!416 = !{!417, !418, !419, !420, !421, !422}
!417 = !DIEnumerator(name: "Done", value: 0)
!418 = !DIEnumerator(name: "RightBrace", value: 1)
!419 = !DIEnumerator(name: "Value", value: 2)
!420 = !DIEnumerator(name: "LeftBrace", value: 3)
!421 = !DIEnumerator(name: "Type", value: 4)
!422 = !DIEnumerator(name: "Backslash", value: 5)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CharErrorKind", scope: !424, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !425)
!424 = !DINamespace(name: "convert", scope: !415)
!425 = !{!426, !427}
!426 = !DIEnumerator(name: "EmptyString", value: 0)
!427 = !DIEnumerator(name: "TooManyChars", value: 1)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ChainState", scope: !429, file: !18, baseType: !14, size: 8, align: 8, flags: DIFlagEnumClass, elements: !432)
!429 = !DINamespace(name: "chain", scope: !430)
!430 = !DINamespace(name: "adapters", scope: !431)
!431 = !DINamespace(name: "iter", scope: !29)
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "Both", value: 0)
!434 = !DIEnumerator(name: "Front", value: 1)
!435 = !DIEnumerator(name: "Back", value: 2)
!436 = !{!437, !446, !448, !453, !458, !463, !468, !473, !486, !563, !596, !627, !645, !674, !677, !700, !732, !735, !742, !744, !760, !763, !765, !769, !777, !781, !784, !787, !790, !793, !796, !799, !802, !808, !835, !838, !842, !846, !851, !861, !865, !869, !873, !877, !889, !891, !895, !897, !901, !905, !909, !913, !917, !921, !946, !950, !954, !963, !975, !982, !990, !998, !1002, !1006, !1010, !1014, !1018, !1022, !1026, !1030, !1034, !1137, !1141, !1145, !1154, !1170, !1180, !1184, !1188, !1215, !1234, !1241, !1245, !1249, !1253, !1257, !1266, !1270, !1281, !1314, !1318, !1322, !1336, !1340, !1349, !1352, !1355, !1367, !1374, !1386, !1398, !1410, !1418, !1426, !1436, !1441, !1449, !1454, !1457, !1462, !1467, !1472, !1475, !1480, !1485, !1490, !1493, !1498, !1503, !1506, !1509, !1511, !1516, !1521, !1524, !1529, !1534, !1539, !1542, !1547, !1552, !1557, !1560, !1562, !1567, !1572, !1575, !1580, !1585, !1590, !1603, !1605, !1609, !1613, !1617, !1621, !1625, !1632, !1637, !1642}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "POW10", linkageName: "_ZN4core3num7flt2dec8strategy6dragon5POW1017h42dc653ed15c6335E", scope: !439, file: !442, line: 14, type: !443, isLocal: true, isDefinition: true, align: 4)
!439 = !DINamespace(name: "dragon", scope: !440)
!440 = !DINamespace(name: "strategy", scope: !441)
!441 = !DINamespace(name: "flt2dec", scope: !204)
!442 = !DIFile(filename: "src/libcore/num/flt2dec/strategy/dragon.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, align: 32, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 10)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "TWOPOW10", linkageName: "_ZN4core3num7flt2dec8strategy6dragon8TWOPOW1017h204fe8230070f83cE", scope: !439, file: !442, line: 16, type: !443, isLocal: true, isDefinition: true, align: 4)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "POW10TO16", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO1617h40d75baca5f05d1cE", scope: !439, file: !442, line: 20, type: !450, isLocal: true, isDefinition: true, align: 4)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, align: 32, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 2)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "POW10TO32", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO3217h520b27905a43d4e0E", scope: !439, file: !442, line: 21, type: !455, isLocal: true, isDefinition: true, align: 4)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 128, align: 32, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 4)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "POW10TO64", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW10TO6417h5e9c6074484aacd5E", scope: !439, file: !442, line: 22, type: !460, isLocal: true, isDefinition: true, align: 4)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 224, align: 32, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 7)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "POW10TO128", linkageName: "_ZN4core3num7flt2dec8strategy6dragon10POW10TO12817hf51552a96e9da9b9E", scope: !439, file: !442, line: 23, type: !465, isLocal: true, isDefinition: true, align: 4)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 448, align: 32, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 14)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "POW10TO256", linkageName: "_ZN4core3num7flt2dec8strategy6dragon10POW10TO25617h6ba6f8e548919b5cE", scope: !439, file: !442, line: 27, type: !470, isLocal: true, isDefinition: true, align: 4)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 864, align: 32, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 27)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "CACHED_POW10", linkageName: "_ZN4core3num7flt2dec8strategy5grisu12CACHED_POW1017hb06c8a215053ada0E", scope: !475, file: !476, line: 28, type: !477, isLocal: false, isDefinition: true, align: 8)
!475 = !DINamespace(name: "grisu", scope: !440)
!476 = !DIFile(filename: "src/libcore/num/flt2dec/strategy/grisu.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 10368, align: 64, elements: !484)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, i16, i16)", file: !18, size: 128, align: 64, elements: !479, templateParams: !42, identifier: "8829cb0cc2e8f23031a37cefb43d84a1")
!479 = !{!480, !481, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !478, file: !18, baseType: !320, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !478, file: !18, baseType: !482, size: 16, align: 16, offset: 64)
!482 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !478, file: !18, baseType: !482, size: 16, align: 16, offset: 80)
!484 = !{!485}
!485 = !DISubrange(count: 81)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !489, identifier: "vtable")
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDefault>, core::char::EscapeDefault>", scope: !490, file: !18, size: 512, align: 64, elements: !491, templateParams: !560, identifier: "982007f91a3b85b7c60956b0cddbe39f")
!490 = !DINamespace(name: "flatten", scope: !430)
!491 = !{!492, !517, !559}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !489, file: !18, baseType: !493, size: 128, align: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeDefault>", scope: !430, file: !18, size: 128, align: 64, elements: !494, templateParams: !514, identifier: "84b6b81f35ad840512f6302ed9b309d")
!494 = !{!495, !512}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !493, file: !18, baseType: !496, size: 128, align: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !220, file: !18, size: 128, align: 64, elements: !497, templateParams: !42, identifier: "bd300a77bef2cee25b2d20d02fdb7313")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !496, file: !18, baseType: !499, size: 128, align: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !500, file: !18, size: 128, align: 64, elements: !501, templateParams: !91, identifier: "16f1b42b964586b1da3064a2d86304d5")
!500 = !DINamespace(name: "slice", scope: !29)
!501 = !{!502, !507, !508}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !499, file: !18, baseType: !503, size: 64, align: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !504, file: !18, size: 64, align: 64, elements: !505, templateParams: !91, identifier: "c9ff8f101d3f31cd66b42144ff32cc94")
!504 = !DINamespace(name: "non_null", scope: !85)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !503, file: !18, baseType: !13, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !499, file: !18, baseType: !13, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !499, file: !18, baseType: !509, align: 8)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !90, file: !18, align: 8, elements: !42, templateParams: !510, identifier: "f3f38f6c783b38164f92bbfa8f8cd70c")
!510 = !{!511}
!511 = !DITemplateTypeParameter(name: "T", type: !104)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !493, file: !18, baseType: !513, align: 8)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeDefault", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "394293d254cf1ba453c84f7071f5db5b")
!514 = !{!515, !516}
!515 = !DITemplateTypeParameter(name: "I", type: !496)
!516 = !DITemplateTypeParameter(name: "F", type: !513)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !489, file: !18, baseType: !518, size: 192, align: 64, offset: 128)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeDefault>", scope: !225, file: !18, size: 192, align: 64, elements: !519, identifier: "2f4bf2d6eb874726a0ca5f357f7ed27a")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 192, align: 64, elements: !521, templateParams: !524, identifier: "2f4bf2d6eb874726a0ca5f357f7ed27a_variant_part", discriminator: !558)
!521 = !{!522, !554}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !520, file: !18, baseType: !523, size: 192, align: 64, extraData: i64 4)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !518, file: !18, size: 192, align: 64, elements: !42, templateParams: !524, identifier: "2f4bf2d6eb874726a0ca5f357f7ed27a::None")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDefault", scope: !415, file: !18, size: 192, align: 64, elements: !527, templateParams: !42, identifier: "6e3400e6571b7c8fe70ef5438385924a")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !526, file: !18, baseType: !529, size: 192, align: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDefaultState", scope: !415, file: !18, size: 192, align: 64, elements: !530, identifier: "25fa234eeda7b7f1135be83fa56973a")
!530 = !{!531}
!531 = !DICompositeType(tag: DW_TAG_variant_part, scope: !415, file: !18, size: 192, align: 64, elements: !532, templateParams: !42, identifier: "25fa234eeda7b7f1135be83fa56973a_variant_part", discriminator: !553)
!532 = !{!533, !535, !540, !544}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Done", scope: !531, file: !18, baseType: !534, size: 192, align: 64, extraData: i64 0)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Done", scope: !529, file: !18, size: 192, align: 64, elements: !42, templateParams: !42, identifier: "25fa234eeda7b7f1135be83fa56973a::Done")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !531, file: !18, baseType: !536, size: 192, align: 64, extraData: i64 1)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !529, file: !18, size: 192, align: 64, elements: !537, templateParams: !42, identifier: "25fa234eeda7b7f1135be83fa56973a::Char")
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !536, file: !18, baseType: !539, size: 32, align: 32, offset: 32)
!539 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Backslash", scope: !531, file: !18, baseType: !541, size: 192, align: 64, extraData: i64 2)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backslash", scope: !529, file: !18, size: 192, align: 64, elements: !542, templateParams: !42, identifier: "25fa234eeda7b7f1135be83fa56973a::Backslash")
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !541, file: !18, baseType: !539, size: 32, align: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Unicode", scope: !531, file: !18, baseType: !545, size: 192, align: 64, extraData: i64 3)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unicode", scope: !529, file: !18, size: 192, align: 64, elements: !546, templateParams: !42, identifier: "25fa234eeda7b7f1135be83fa56973a::Unicode")
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !545, file: !18, baseType: !548, size: 128, align: 64, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeUnicode", scope: !415, file: !18, size: 128, align: 64, elements: !549, templateParams: !42, identifier: "d226c06e56bc774a4854e18ee390a6dd")
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !548, file: !18, baseType: !539, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !548, file: !18, baseType: !414, size: 8, align: 8, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hex_digit_idx", scope: !548, file: !18, baseType: !94, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, scope: !415, file: !18, baseType: !342, size: 32, align: 32, flags: DIFlagArtificial)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !520, file: !18, baseType: !555, size: 192, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !518, file: !18, size: 192, align: 64, elements: !556, templateParams: !524, identifier: "2f4bf2d6eb874726a0ca5f357f7ed27a::Some")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !18, baseType: !526, size: 192, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !18, baseType: !342, size: 32, align: 32, flags: DIFlagArtificial)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !489, file: !18, baseType: !518, size: 192, align: 64, offset: 320)
!560 = !{!561, !562}
!561 = !DITemplateTypeParameter(name: "I", type: !493)
!562 = !DITemplateTypeParameter(name: "U", type: !526)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !566, identifier: "vtable")
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeDebugContinue>, core::char::EscapeDebug>", scope: !490, file: !18, size: 512, align: 64, elements: !567, templateParams: !593, identifier: "c3e661133698f454eeacf3011290723b")
!567 = !{!568, !576, !592}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !566, file: !18, baseType: !569, size: 128, align: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeDebugContinue>", scope: !430, file: !18, size: 128, align: 64, elements: !570, templateParams: !574, identifier: "acccbfb5417941e78b35a8468f770e42")
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !569, file: !18, baseType: !496, size: 128, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !569, file: !18, baseType: !573, align: 8)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeDebugContinue", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "a4170c422f21471cca9376b98534a9c5")
!574 = !{!515, !575}
!575 = !DITemplateTypeParameter(name: "F", type: !573)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !566, file: !18, baseType: !577, size: 192, align: 64, offset: 128)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeDebug>", scope: !225, file: !18, size: 192, align: 64, elements: !578, identifier: "4aecc4d2e4d8d092618e064c462ffa15")
!578 = !{!579}
!579 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 192, align: 64, elements: !580, templateParams: !583, identifier: "4aecc4d2e4d8d092618e064c462ffa15_variant_part", discriminator: !558)
!580 = !{!581, !588}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !579, file: !18, baseType: !582, size: 192, align: 64, extraData: i64 4)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !577, file: !18, size: 192, align: 64, elements: !42, templateParams: !583, identifier: "4aecc4d2e4d8d092618e064c462ffa15::None")
!583 = !{!584}
!584 = !DITemplateTypeParameter(name: "T", type: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "EscapeDebug", scope: !415, file: !18, size: 192, align: 64, elements: !586, templateParams: !42, identifier: "dbd6f92f0d83de275d1ce3bb760f4cf5")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !585, file: !18, baseType: !526, size: 192, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !579, file: !18, baseType: !589, size: 192, align: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !577, file: !18, size: 192, align: 64, elements: !590, templateParams: !583, identifier: "4aecc4d2e4d8d092618e064c462ffa15::Some")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !589, file: !18, baseType: !585, size: 192, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !566, file: !18, baseType: !577, size: 192, align: 64, offset: 320)
!593 = !{!594, !595}
!594 = !DITemplateTypeParameter(name: "I", type: !569)
!595 = !DITemplateTypeParameter(name: "U", type: !585)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !599, identifier: "vtable")
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::iter::adapters::Map<core::str::Chars, core::str::CharEscapeUnicode>, core::char::EscapeUnicode>", scope: !490, file: !18, size: 384, align: 64, elements: !600, templateParams: !624, identifier: "29f2fed324c649698f8d3a3c9ee1ce59")
!600 = !{!601, !609, !623}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !599, file: !18, baseType: !602, size: 128, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::str::Chars, core::str::CharEscapeUnicode>", scope: !430, file: !18, size: 128, align: 64, elements: !603, templateParams: !607, identifier: "23ae941d708673e68b0a020d6f177164")
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !602, file: !18, baseType: !496, size: 128, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !602, file: !18, baseType: !606, align: 8)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharEscapeUnicode", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "c59fd93d95649e69787a899465e5a6ce")
!607 = !{!515, !608}
!608 = !DITemplateTypeParameter(name: "F", type: !606)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !599, file: !18, baseType: !610, size: 128, align: 64, offset: 128)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::char::EscapeUnicode>", scope: !225, file: !18, size: 128, align: 64, elements: !611, identifier: "299e8b46438bfb2d93a9238f5d5839ef")
!611 = !{!612}
!612 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !18, size: 128, align: 64, elements: !613, templateParams: !616, identifier: "299e8b46438bfb2d93a9238f5d5839ef_variant_part", discriminator: !622)
!613 = !{!614, !618}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !612, file: !18, baseType: !615, size: 128, align: 64, extraData: i64 1114112)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !610, file: !18, size: 128, align: 64, elements: !42, templateParams: !616, identifier: "299e8b46438bfb2d93a9238f5d5839ef::None")
!616 = !{!617}
!617 = !DITemplateTypeParameter(name: "T", type: !548)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !612, file: !18, baseType: !619, size: 128, align: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !610, file: !18, size: 128, align: 64, elements: !620, templateParams: !616, identifier: "299e8b46438bfb2d93a9238f5d5839ef::Some")
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !619, file: !18, baseType: !548, size: 128, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !18, baseType: !342, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !599, file: !18, baseType: !610, size: 128, align: 64, offset: 256)
!624 = !{!625, !626}
!625 = !DITemplateTypeParameter(name: "I", type: !602)
!626 = !DITemplateTypeParameter(name: "U", type: !548)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !630, identifier: "vtable")
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "FlattenCompat<core::option::IntoIter<core::char::EscapeDebug>, core::char::EscapeDebug>", scope: !490, file: !18, size: 576, align: 64, elements: !631, templateParams: !643, identifier: "4a33a67ad4ce90621472f339b59b7d3")
!631 = !{!632, !641, !642}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !630, file: !18, baseType: !633, size: 192, align: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<core::char::EscapeDebug>", scope: !225, file: !18, size: 192, align: 64, elements: !634, templateParams: !639, identifier: "3c41331104b7fa6cc15368080d12713a")
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !633, file: !18, baseType: !636, size: 192, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Item<core::char::EscapeDebug>", scope: !225, file: !18, size: 192, align: 64, elements: !637, templateParams: !639, identifier: "d44384643d113374eb811a52a946b75a")
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !636, file: !18, baseType: !577, size: 192, align: 64)
!639 = !{!640}
!640 = !DITemplateTypeParameter(name: "A", type: !585)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "frontiter", scope: !630, file: !18, baseType: !577, size: 192, align: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "backiter", scope: !630, file: !18, baseType: !577, size: 192, align: 64, offset: 384)
!643 = !{!644, !595}
!644 = !DITemplateTypeParameter(name: "I", type: !633)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !648, identifier: "vtable")
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitTerminator<char>", scope: !220, file: !18, size: 576, align: 64, elements: !649, templateParams: !672, identifier: "25176f86471df7cd64761788fc6cb09")
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !648, file: !18, baseType: !651, size: 576, align: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitInternal<char>", scope: !220, file: !18, size: 576, align: 64, elements: !652, templateParams: !672, identifier: "6c126a098c1725778774ce4f90059af")
!652 = !{!653, !654, !655, !670, !671}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !651, file: !18, baseType: !94, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !651, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "matcher", scope: !651, file: !18, baseType: !656, size: 384, align: 64, offset: 128)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharSearcher", scope: !657, file: !18, size: 384, align: 64, elements: !658, templateParams: !42, identifier: "cae828961695973533e1b7aabe824a09")
!657 = !DINamespace(name: "pattern", scope: !220)
!658 = !{!659, !664, !665, !666, !667, !668}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "haystack", scope: !656, file: !18, baseType: !660, size: 128, align: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !18, size: 128, align: 64, elements: !661, templateParams: !42, identifier: "111094d970b097647de579f9c509ef08")
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !660, file: !18, baseType: !13, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !660, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "finger", scope: !656, file: !18, baseType: !94, size: 64, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "finger_back", scope: !656, file: !18, baseType: !94, size: 64, align: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "needle", scope: !656, file: !18, baseType: !539, size: 32, align: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_size", scope: !656, file: !18, baseType: !94, size: 64, align: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_encoded", scope: !656, file: !18, baseType: !669, size: 32, align: 8, offset: 352)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32, align: 8, elements: !456)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "allow_trailing_empty", scope: !651, file: !18, baseType: !362, size: 8, align: 8, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !651, file: !18, baseType: !362, size: 8, align: 8, offset: 520)
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "P", type: !539)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !496, identifier: "vtable")
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !680, identifier: "vtable")
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filter<core::slice::Split<u8, core::str::IsAsciiWhitespace>, core::str::BytesIsNotEmpty>", scope: !430, file: !18, size: 192, align: 64, elements: !681, templateParams: !697, identifier: "7d524a7f498b07e3907263d2831894a6")
!681 = !{!682, !695}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !680, file: !18, baseType: !683, size: 192, align: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Split<u8, core::str::IsAsciiWhitespace>", scope: !500, file: !18, size: 192, align: 64, elements: !684, templateParams: !693, identifier: "de8ae44a1d0ab969a51e77c43b97f5da")
!684 = !{!685, !690, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !683, file: !18, baseType: !686, size: 128, align: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !18, size: 128, align: 64, elements: !687, templateParams: !42, identifier: "77a791bc5b00f512104688e88bf00bee")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !686, file: !18, baseType: !13, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !686, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !683, file: !18, baseType: !691, align: 8)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "IsAsciiWhitespace", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "fa2f55f5d3f0ca3cd1aa22755fb844f2")
!692 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !683, file: !18, baseType: !362, size: 8, align: 8, offset: 128)
!693 = !{!92, !694}
!694 = !DITemplateTypeParameter(name: "P", type: !691)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !680, file: !18, baseType: !696, align: 8)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "BytesIsNotEmpty", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "dfb6cf520ad77a5ad6b6d56cd2ca9d6a")
!697 = !{!698, !699}
!698 = !DITemplateTypeParameter(name: "I", type: !683)
!699 = !DITemplateTypeParameter(name: "P", type: !696)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !703, identifier: "vtable")
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "Split<core::str::IsWhitespace>", scope: !220, file: !18, size: 512, align: 64, elements: !704, templateParams: !730, identifier: "8e47efb0273a38d367d76b9cd62fa88d")
!704 = !{!705}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !703, file: !18, baseType: !706, size: 512, align: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "SplitInternal<core::str::IsWhitespace>", scope: !220, file: !18, size: 512, align: 64, elements: !707, templateParams: !730, identifier: "96fc2d5f3a3310ceb360930c739e468c")
!707 = !{!708, !709, !710, !728, !729}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !706, file: !18, baseType: !94, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !706, file: !18, baseType: !94, size: 64, align: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "matcher", scope: !706, file: !18, baseType: !711, size: 320, align: 64, offset: 128)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharPredicateSearcher<core::str::IsWhitespace>", scope: !657, file: !18, size: 320, align: 64, elements: !712, templateParams: !726, identifier: "e5a633793fc64bd4c3552b3cceb52572")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !711, file: !18, baseType: !714, size: 320, align: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiCharEqSearcher<core::str::IsWhitespace>", scope: !657, file: !18, size: 320, align: 64, elements: !715, templateParams: !724, identifier: "6024a7b82903ea64f575ba7878ad4bd")
!715 = !{!716, !718, !719}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "char_eq", scope: !714, file: !18, baseType: !717, align: 8)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "IsWhitespace", scope: !220, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "7d4a0a5f4e820dd9975e389e45bdc87e")
!718 = !DIDerivedType(tag: DW_TAG_member, name: "haystack", scope: !714, file: !18, baseType: !660, size: 128, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "char_indices", scope: !714, file: !18, baseType: !720, size: 192, align: 64, offset: 128)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "CharIndices", scope: !220, file: !18, size: 192, align: 64, elements: !721, templateParams: !42, identifier: "5873b24f7cf30cb778fd226192d3606a")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "front_offset", scope: !720, file: !18, baseType: !94, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !720, file: !18, baseType: !496, size: 128, align: 64, offset: 64)
!724 = !{!725}
!725 = !DITemplateTypeParameter(name: "C", type: !717)
!726 = !{!727}
!727 = !DITemplateTypeParameter(name: "F", type: !717)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "allow_trailing_empty", scope: !706, file: !18, baseType: !362, size: 8, align: 8, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !706, file: !18, baseType: !362, size: 8, align: 8, offset: 456)
!730 = !{!731}
!731 = !DITemplateTypeParameter(name: "P", type: !717)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !683, identifier: "vtable")
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !738, identifier: "vtable")
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoPayload", scope: !739, file: !18, align: 8, elements: !42, templateParams: !42, identifier: "385e6f863ff15a9e11f32c3b02ed99fc")
!739 = !DINamespace(name: "internal_constructor", scope: !740)
!740 = !DINamespace(name: "{{impl}}", scope: !741)
!741 = !DINamespace(name: "panic", scope: !29)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !111, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !747, identifier: "vtable")
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapter", scope: !748, file: !18, size: 192, align: 64, elements: !749, templateParams: !42, identifier: "79fc7657f7bedae6b8bd07eea77946fd")
!748 = !DINamespace(name: "builders", scope: !59)
!749 = !{!750, !755}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !747, file: !18, baseType: !751, size: 128, align: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !59, file: !18, size: 128, align: 64, elements: !752, templateParams: !42, identifier: "d055b81cf38999455d6bdd7a4a6969e")
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !751, file: !18, baseType: !370, size: 64, align: 64, flags: DIFlagArtificial)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !751, file: !18, baseType: !372, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !747, file: !18, baseType: !756, size: 64, align: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapterState", baseType: !757, size: 64, align: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapterState", scope: !748, file: !18, size: 8, align: 8, elements: !758, templateParams: !42, identifier: "8e0982f00e7a71cd485e257342a7c860")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "on_newline", scope: !757, file: !18, baseType: !362, size: 8, align: 8)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !539, identifier: "vtable")
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !103, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !768, identifier: "vtable")
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&char", baseType: !539, size: 64, align: 64)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "DEC_DIGITS_LUT", linkageName: "_ZN4core3fmt3num14DEC_DIGITS_LUT17h451b0a51671e7824E", scope: !771, file: !772, line: 182, type: !773, isLocal: true, isDefinition: true, align: 8)
!771 = !DINamespace(name: "num", scope: !59)
!772 = !DIFile(filename: "src/libcore/fmt/num.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 200]", baseType: !774, size: 64, align: 64)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1600, align: 8, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 200)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !780, identifier: "vtable")
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapter", baseType: !747, size: 64, align: 64)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !686, identifier: "vtable")
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !362, identifier: "vtable")
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !660, identifier: "vtable")
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !720, identifier: "vtable")
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !94, identifier: "vtable")
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !711, identifier: "vtable")
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !656, identifier: "vtable")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "UTF8_CHAR_WIDTH", linkageName: "_ZN4core3str15UTF8_CHAR_WIDTH17h14edf419081ad991E", scope: !220, file: !804, line: 1621, type: !805, isLocal: false, isDefinition: true, align: 1)
!804 = !DIFile(filename: "src/libcore/str/mod.rs", directory: "/rustc/442ae7f04026c215a03b155eaaf9cde8bb5cf02a/")
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 8, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 256)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !811, identifier: "vtable")
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::Waker", baseType: !812, size: 64, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !813, file: !18, size: 128, align: 64, elements: !815, templateParams: !42, identifier: "f20ef06efdc8ecde9956cd9c592f0dbd")
!813 = !DINamespace(name: "wake", scope: !814)
!814 = !DINamespace(name: "task", scope: !29)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !812, file: !18, baseType: !817, size: 128, align: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !813, file: !18, size: 128, align: 64, elements: !818, templateParams: !42, identifier: "e283190e2727eeaeed75773a7d981d33")
!818 = !{!819, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !817, file: !18, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !120, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !817, file: !18, baseType: !822, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !823, size: 64, align: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !813, file: !18, size: 256, align: 64, elements: !824, templateParams: !42, identifier: "b2d93ac9b6ae7921eaa969be1adbe2db")
!824 = !{!825, !829, !833, !834}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !823, file: !18, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !827, size: 64, align: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!817, !820}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !823, file: !18, baseType: !830, size: 64, align: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !831, size: 64, align: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !820}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !823, file: !18, baseType: !830, size: 64, align: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !823, file: !18, baseType: !830, size: 64, align: 64, offset: 192)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !820, identifier: "vtable")
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !841, identifier: "vtable")
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::task::wake::RawWakerVTable", baseType: !823, size: 64, align: 64)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !845, identifier: "vtable")
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u8]", baseType: !686, size: 64, align: 64)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !848, isLocal: true, isDefinition: true)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !849, identifier: "vtable")
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !850, size: 64, align: 64)
!850 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !854, identifier: "vtable")
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::dec2flt::parse::Decimal", baseType: !855, size: 64, align: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decimal", scope: !856, file: !18, size: 320, align: 64, elements: !857, templateParams: !42, identifier: "b7a652558fc59cf6666d26ed9a20bc19")
!856 = !DINamespace(name: "parse", scope: !404)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !855, file: !18, baseType: !686, size: 128, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fractional", scope: !855, file: !18, baseType: !686, size: 128, align: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !855, file: !18, baseType: !850, size: 64, align: 64, offset: 256)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !864, identifier: "vtable")
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !320, size: 64, align: 64)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !868, identifier: "vtable")
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i16", baseType: !482, size: 64, align: 64)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !872, identifier: "vtable")
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::dec2flt::FloatErrorKind", baseType: !403, size: 64, align: 64)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !876, identifier: "vtable")
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !362, size: 64, align: 64)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !880, identifier: "vtable")
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::flt2dec::decoder::Decoded", baseType: !881, size: 64, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Decoded", scope: !882, file: !18, size: 256, align: 64, elements: !883, templateParams: !42, identifier: "436f6def977f09da1bc6707b750584d")
!882 = !DINamespace(name: "decoder", scope: !441)
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !881, file: !18, baseType: !320, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "minus", scope: !881, file: !18, baseType: !320, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "plus", scope: !881, file: !18, baseType: !320, size: 64, align: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !881, file: !18, baseType: !482, size: 16, align: 16, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !881, file: !18, baseType: !362, size: 8, align: 8, offset: 208)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !254, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !894, identifier: "vtable")
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !94, size: 64, align: 64)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !209, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !899, isLocal: true, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !900, identifier: "vtable")
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::IntErrorKind", baseType: !408, size: 64, align: 64)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !903, isLocal: true, isDefinition: true)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !904, identifier: "vtable")
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::convert::CharErrorKind", baseType: !423, size: 64, align: 64)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !908, identifier: "vtable")
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeUnicodeState", baseType: !414, size: 64, align: 64)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !912, identifier: "vtable")
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeDefaultState", baseType: !529, size: 64, align: 64)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !916, identifier: "vtable")
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeUnicode", baseType: !548, size: 64, align: 64)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !920, identifier: "vtable")
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::EscapeDefault", baseType: !526, size: 64, align: 64)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "vtable", scope: null, file: !18, type: !923, isLocal: true, isDefinition: true)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "vtable", file: !18, align: 64, flags: DIFlagArtificial, elements: !42, vtableHolder: !924, identifier: "vtable")
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::char::CaseMappingIter", baseType: !925, size: 64, align: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "CaseMappingIter", scope: !415, file: !18, size: 128, align: 32, elements: !926, identifier: "8bc5d6b5c74535639cbaa94b934ceb54")
!926 = !{!927}
!927 = !DICompositeType(tag: DW_TAG_variant_part, scope: !415, file: !18, size: 128, align: 32, elements: !928, templateParams: !42, identifier: "8bc5d6b5c74535639cbaa94b934ceb54_variant_part", discriminator: !553)
!928 = !{!929, !935, !940, !944}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Three", scope: !927, file: !18, baseType: !930, size: 128, align: 32, extraData: i64 0)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Three", scope: !925, file: !18, size: 128, align: 32, elements: !931, templateParams: !42, identifier: "8bc5d6b5c74535639cbaa94b934ceb54::Three")
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !18, baseType: !539, size: 32, align: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !930, file: !18, baseType: !539, size: 32, align: 32, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !930, file: !18, baseType: !539, size: 32, align: 32, offset: 96)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Two", scope: !927, file: !18, baseType: !936, size: 128, align: 32, extraData: i64 1)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "Two", scope: !925, file: !18, size: 128, align: 32, elements: !937, templateParams: !42, identifier: "8bc5d6b5c74535639cbaa94b934ceb54::Two")
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !936, file: !18, baseType: !539, size: 32, align: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !936, file: !18, baseType: !539, size: 32, align: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "One", scope: !927, file: !18, baseType: !941, size: 128, align: 32, extraData: i64 2)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "One", scope: !925, file: !18, size: 128, align: 32, elements: !942, templateParams: !42, identifier: "8bc5d6b5c74535639cbaa94b934ceb54::One")
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !941, file: !18, baseType: !539, size: 32, align: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Zero", scope: !927, file: !18, baseType: !945, size: 128, align: 32, extraData: i64 3)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zero", scope: !925, file: !18, size: 128, align: 32, elements: !42, templateParams: !42, identifier: "8bc5d6b5c74535639cbaa94b934ceb54::Zero")
